Extensions/АБ/Catalogs/ТематикиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТематикиДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АБ_ВходящиеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОтправитьДоговорКонтрагенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СформироватьДоговорВЕРП</Name>
					<Comment>Документ при запуске в обработку будет отправлен в ERP</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_УстановитьЗначенияПоУмолчанию</Name>
					<Comment>При создании нового документа с этой тематикой реквизиты заполняются значениями по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ФормаКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Catalogs/ТематикиДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 03.04.2026 (320030) исправление тумблера  
	СвойстваВхДокументы = Новый Структура;
	СвойстваВхДокументы.Вставить("ФорматРедактирования", "БЛ='Исходящий документ'; БИ='Входящий документ'");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "АБ_ВходящиеДокументы", Элементы.Основное, "Объект.АБ_ВходящиеДокументы",
	"Тип документа", 2, СвойстваВхДокументы,, Элементы.ГруппаНеДействует);
	//--dar 03.04.2026 (320030)
	
	//++dar 17.04.26 (323881)
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_ОтправитьДоговорКонтрагенту", Элементы.Основное, Истина, 
	"Отправить договор контрагенту (при запуске обработки)", 1, , , Элементы.ГруппаНеДействует);
	//--dar 17.04.26 (323881)
	
	//++GIV 03042026 (320030)
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_СформироватьДоговорВЕРП", Элементы.Основное, "Объект.УВМ_СформироватьДоговорВЕРП",
	"Сформировать договор в 1С:ERP (при запуске обработки)", 1,,, Элементы.ГруппаНеДействует);
	//--GIV 03042026 (320030)

	//++dar 07.05.26 (326008)	
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_ФормаКонтрагента", Элементы.Основное, Истина, , 1, , , Элементы.ГруппаНеДействует);
	//--dar 07.05.26 (326008)	
	
	//++dar 22.06.26 (333905)
	ПолеУстановитьЗначения = УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_УстановитьЗначенияПоУмолчанию",
								Элементы.Основное, "Объект.УВМ_УстановитьЗначенияПоУмолчанию",
								"Установить значения по умолчанию", 1, , , Элементы.ГруппаНеДействует);
	
	ПолеУстановитьЗначения.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	//--dar 22.06.26 (333905)

КонецПроцедуры
